{
  "halls": [
    {
      "id": "ancient-russia",
      "title": "Древняя Русь",
      "description": "История зарождения и развития древнерусского государства с IX по XIII век",
      "image": "/placeholder.svg?height=400&width=600",
      "exhibitsCount": 4
    },
    {
      "id": "moscow-tsardom",
      "title": "Московское царство",
      "description": "Эпоха объединения русских земель и становления централизованного государства",
      "image": "/placeholder.svg?height=400&width=600",
      "exhibitsCount": 3
    },
    {
      "id": "russian-empire",
      "title": "Российская империя",
      "description": "От реформ Петра I до революционных событий начала XX века",
      "image": "/placeholder.svg?height=400&width=600",
      "exhibitsCount": 4
    },
    {
      "id": "soviet-era",
      "title": "Советский период",
      "description": "История СССР: революция, индустриализация, Великая Отечественная война",
      "image": "/placeholder.svg?height=400&width=600",
      "exhibitsCount": 3
    },
    {
      "id": "kremlin-tour",
      "title": "Экскурсия по Кремлю",
      "description": "Государственная символика Руси в 15 веке",
      "image": "/hall5.png?height=400&width=600",
      "exhibitsCount": 5
    }
  ],
  "exhibits": [
    {
      "id": "rurik-arrival",
      "hallId": "ancient-russia",
      "title": "Призвание варягов",
      "description": "Легендарное событие 862 года, когда славянские и финно-угорские племена призвали варяжских князей для управления своими землями. Рюрик стал первым правителем, положившим начало династии Рюриковичей.",
      "fullDescription": "Призвание варягов — легендарное событие, с которого традиционно отсчитывается начало русской государственности. Согласно «Повести временных лет», в 862 году славянские и финно-угорские племена, уставшие от междоусобиц, решили пригласить варяжского князя для наведения порядка.\n\nРюрик с братьями Синеусом и Трувором откликнулись на призыв. Рюрик обосновался в Новгороде (по другой версии — в Ладоге), Синеус — в Белоозере, Трувор — в Изборске. После смерти братьев Рюрик стал единоличным правителем.\n\nЭто событие положило начало династии Рюриковичей, правившей Русью более 700 лет. Современные историки ведут дискуссии о достоверности летописного рассказа, но факт скандинавского влияния на формирование древнерусского государства подтверждается археологическими находками.",
      "date": "862",
      "startDate": 862,
      "endDate": 862,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Летописные свидетельства", "Археологические находки", "Карты расселения племён"]
    },
    {
      "id": "baptism-of-rus",
      "hallId": "ancient-russia",
      "title": "Крещение Руси",
      "description": "Принятие христианства князем Владимиром в 988 году стало поворотным моментом в истории Руси, определившим культурное и духовное развитие народа.",
      "fullDescription": "Крещение Руси — одно из важнейших событий в истории восточных славян. В 988 году киевский князь Владимир Святославич принял решение о крещении Руси по византийскому обряду.\n\nСогласно летописи, Владимир выбирал веру среди нескольких вариантов: ислама, иудаизма, западного и восточного христианства. Красота богослужения в константинопольском храме Святой Софии произвела на его посланников неизгладимое впечатление.\n\nКрещение началось в Киеве, где жители города были крещены в водах Днепра. Затем новая вера распространилась по другим городам и землям. Принятие христианства способствовало развитию письменности, архитектуры, живописи и укрепило международные связи Руси.",
      "startDate": 988,
      "endDate": 988,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Иконы X века", "Кресты-энколпионы", "Церковные книги"]
    },
    {
      "id": "yaroslav-wise",
      "hallId": "ancient-russia",
      "title": "Правление Ярослава Мудрого",
      "description": "Эпоха расцвета Киевской Руси при князе Ярославе: создание «Русской Правды», строительство соборов, развитие культуры.",
      "fullDescription": "Ярослав Мудрый (около 978–1054) — один из наиболее выдающихся правителей Древней Руси. Его правление (1019–1054) считается временем наивысшего расцвета Киевского государства.\n\nПри Ярославе был создан первый свод законов — «Русская Правда», регулировавший правовые отношения в обществе. Князь активно строил храмы, включая знаменитый Софийский собор в Киеве, основал монастыри и школы.\n\nЯрослав установил династические связи со многими европейскими дворами: его дочери стали королевами Франции, Норвегии и Венгрии. При нём Киев превратился в один из крупнейших городов Европы с населением около 50 000 человек.",
      "startDate": 1019,
      "endDate": 1054,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Русская Правда", "Софийский собор", "Златники и сребреники"]
    },
    {
      "id": "mongol-invasion",
      "hallId": "ancient-russia",
      "title": "Монгольское нашествие",
      "description": "Вторжение войск Батыя на Русь в 1237-1240 годах, разорение городов и начало периода ордынского ига.",
      "fullDescription": "Монгольское нашествие на Русь (1237–1240) стало катастрофой для древнерусских земель. Войска хана Батыя, внука Чингисхана, обрушились на русские княжества, не сумевшие объединиться перед лицом общего врага.\n\nПервым пал Рязань в декабре 1237 года. Затем были разорены Владимир, Суздаль, Москва, Тверь и десятки других городов. В 1240 году пал Киев — столица Руси превратилась в руины.\n\nНачался период ордынского ига, продлившийся около 240 лет. Русские князья были вынуждены получать ярлыки на княжение в Орде и платить дань. Это время серьёзно повлияло на развитие русской государственности и культуры.",
      "startDate": 1237,
      "endDate": 1240,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Оружие XIII века", "Летописные миниатюры", "Клады монет"]
    },
    {
      "id": "ivan-terrible",
      "hallId": "moscow-tsardom",
      "title": "Правление Ивана Грозного",
      "description": "Первый русский царь, реформатор и завоеватель. Покорение Казани и Астрахани, опричнина и Ливонская война.",
      "fullDescription": "Иван IV Васильевич (1530–1584), прозванный Грозным, стал первым русским правителем, принявшим титул царя в 1547 году. Его долгое правление было временем великих свершений и страшных трагедий.\n\nВ первый период царствования Иван провёл важные реформы: созвал первый Земский собор, издал новый Судебник, реформировал армию. Были завоёваны Казанское и Астраханское ханства, что открыло путь на восток.\n\nОднако с 1560-х годов начался период террора — опричнина. Царь учредил особый корпус опричников, проводивших массовые репрессии. Погиб старший сын царя, разорительной оказалась Ливонская война. Правление Ивана Грозного заложило основы самодержавия, но и привело страну к Смутному времени.",
      "startDate": 1547,
      "endDate": 1584,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Шапка Мономаха", "Царский трон", "Опричный знак"]
    },
    {
      "id": "time-of-troubles",
      "hallId": "moscow-tsardom",
      "title": "Смутное время",
      "description": "Период политического кризиса, самозванцев и иностранной интервенции в начале XVII века.",
      "fullDescription": "Смутное время (1598–1613) — один из самых драматичных периодов русской истории. После смерти последнего Рюриковича — царя Фёдора Иоанновича — началась борьба за власть и череда потрясений.\n\nНа престоле сменялись Борис Годунов, Лжедмитрий I, Василий Шуйский. Появлялись всё новые самозванцы, претендовавшие на трон. Польские и шведские войска вторглись в Россию, в 1610 году поляки заняли Москву.\n\nСпасение пришло от народного ополчения под руководством Кузьмы Минина и князя Дмитрия Пожарского. В 1612 году Москва была освобождена, а в 1613 году Земский собор избрал на царство Михаила Романова, положив начало новой династии.",
      "startDate": 1598,
      "endDate": 1613,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Оружие ополченцев", "Грамоты Смутного времени", "Портреты царей"]
    },
    {
      "id": "romanov-dynasty",
      "hallId": "moscow-tsardom",
      "title": "Начало династии Романовых",
      "description": "Избрание Михаила Романова на царство в 1613 году и восстановление государственности после Смуты.",
      "fullDescription": "21 февраля 1613 года Земский собор избрал на царство 16-летнего Михаила Фёдоровича Романова. Этот выбор положил конец Смутному времени и дал начало династии, правившей Россией более 300 лет.\n\nМихаил Романов был сыном патриарха Филарета и приходился двоюродным племянником последнему царю из династии Рюриковичей. Его кандидатура устроила большинство как компромиссная фигура.\n\nПервые Романовы — Михаил и его сын Алексей Михайлович — сумели восстановить страну после разрухи, укрепить центральную власть, вернуть утраченные территории. При них был принят Соборное уложение 1649 года и присоединена Украина.",
      "startDate": 1613,
      "endDate": 1613,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Избирательная грамота", "Венец Михаила Романова", "Портрет первого Романова"]
    },
    {
      "id": "peter-great",
      "hallId": "russian-empire",
      "title": "Реформы Петра I",
      "description": "Коренное преобразование России: создание флота, основание Санкт-Петербурга, европеизация страны.",
      "fullDescription": "Пётр I Великий (1672–1725) радикально изменил облик России, превратив её из Московского царства в Российскую империю. Его реформы затронули все сферы жизни общества.\n\nПётр создал регулярную армию и военно-морской флот, одержал победу в Северной войне со Швецией, получив выход к Балтийскому морю. В 1703 году он основал новую столицу — Санкт-Петербург, ставший «окном в Европу».\n\nЦарь реформировал государственное управление, создав Сенат и коллегии, ввёл Табель о рангах, подчинил церковь государству. Он насаждал европейское образование, одежду, обычаи. В 1721 году Пётр принял титул императора, а Россия стала империей.",
      "startDate": 1682,
      "endDate": 1725,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Ботик Петра", "Указы императора", "Медали Северной войны"]
    },
    {
      "id": "catherine-great",
      "hallId": "russian-empire",
      "title": "Правление Екатерины II",
      "description": "Эпоха просвещённого абсолютизма, расширение империи, расцвет культуры и искусства.",
      "fullDescription": "Екатерина II Великая (1729–1796) правила Россией 34 года, сделав её одной из ведущих держав мира. Немецкая принцесса София Августа Фредерика Ангальт-Цербстская стала русской императрицей в результате дворцового переворота 1762 года.\n\nЕкатерина проводила политику просвещённого абсолютизма: созвала Уложенную комиссию, провела губернскую реформу, издала Жалованные грамоты дворянству и городам. При ней расцвели наука и искусство, был основан Эрмитаж.\n\nВ результате русско-турецких войн Россия присоединила Крым и Причерноморье. Три раздела Речи Посполитой включили в состав империи земли Белоруссии и Правобережной Украины. Население России выросло с 19 до 36 миллионов человек.",
      "startDate": 1762,
      "endDate": 1796,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Императорская корона", "Коллекция Эрмитажа", "Наказ Уложенной комиссии"]
    },
    {
      "id": "war-1812",
      "hallId": "russian-empire",
      "title": "Отечественная война 1812 года",
      "description": "Нашествие армии Наполеона на Россию, Бородинское сражение, пожар Москвы и изгнание французов.",
      "fullDescription": "Отечественная война 1812 года стала одним из важнейших событий русской и мировой истории. 24 июня 1812 года армия Наполеона численностью более 600 000 человек перешла Неман и вторглась в Россию.\n\nРусская армия под командованием Михаила Кутузова отступала, избегая генерального сражения. 7 сентября состоялась Бородинская битва — крупнейшее сражение войны. Обе стороны понесли огромные потери, но ни одна не одержала решительной победы.\n\nПосле взятия французами оставленной Москвы начался перелом. Пожар уничтожил большую часть города, армия Наполеона лишилась припасов. Отступление Grande Armée превратилось в катастрофу: из России вернулось менее 30 000 человек. Победа подняла национальное самосознание и укрепила позиции России в Европе.",
      "startDate": 1812,
      "endDate": 1812,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Знамёна 1812 года", "Оружие эпохи", "Портреты героев"]
    },
    {
      "id": "abolition-serfdom",
      "hallId": "russian-empire",
      "title": "Отмена крепостного права",
      "description": "Великая реформа 1861 года, освободившая крестьян от крепостной зависимости.",
      "fullDescription": "19 февраля 1861 года император Александр II подписал Манифест об отмене крепостного права — документ, изменивший судьбу миллионов людей. Крепостничество, существовавшее в России несколько столетий, было ликвидировано.\n\nПо реформе крестьяне получали личную свободу и гражданские права. Однако земля оставалась собственностью помещиков, и крестьяне должны были её выкупать. За пользование наделами до выкупа они продолжали нести повинности.\n\nОтмена крепостного права стала частью Великих реформ Александра II, включавших также судебную, земскую, военную и другие реформы. Эти преобразования модернизировали Россию, но их непоследовательность и половинчатость создали предпосылки для будущих социальных потрясений.",
      "startDate": 1861,
      "endDate": 1861,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Манифест 1861 года", "Уставные грамоты", "Медаль в память реформы"]
    },
    {
      "id": "october-revolution",
      "hallId": "soviet-era",
      "title": "Октябрьская революция",
      "description": "События октября 1917 года, приход большевиков к власти и начало новой эпохи в истории России.",
      "fullDescription": "Октябрьская революция 1917 года стала поворотным моментом в мировой истории. В ночь с 25 на 26 октября (7–8 ноября по новому стилю) большевики под руководством Владимира Ленина свергли Временное правительство.\n\nРеволюции предшествовал глубокий кризис: Первая мировая война истощила страну, Февральская революция свергла монархию, но не решила основных проблем. Лозунги большевиков «Мир — народам!», «Земля — крестьянам!», «Фабрики — рабочим!» нашли широкую поддержку.\n\nПосле взятия Зимнего дворца II Всероссийский съезд Советов провозгласил переход власти к Советам, принял Декреты о мире и о земле. Началось строительство первого в мире социалистического государства, сопровождавшееся Гражданской войной и радикальными преобразованиями.",
      "startDate": 1917,
      "endDate": 1917,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Декрет о мире", "Революционные плакаты", "Оружие красногвардейцев"]
    },
    {
      "id": "great-patriotic-war",
      "hallId": "soviet-era",
      "title": "Великая Отечественная война",
      "description": "Героическая борьба советского народа против нацистской Германии в 1941-1945 годах.",
      "fullDescription": "Великая Отечественная война (1941–1945) стала самым тяжёлым испытанием в истории нашей страны. 22 июня 1941 года нацистская Германия вероломно напала на Советский Союз.\n\nПервые месяцы войны были катастрофическими: враг стремительно продвигался вглубь страны. Однако героическая оборона Москвы зимой 1941 года показала, что вермахт можно остановить. Сталинградская битва (1942–1943) стала переломным моментом войны.\n\nПосле победы на Курской дуге началось освобождение оккупированных территорий. 9 мая 1945 года Германия капитулировала. Победа досталась страшной ценой — погибли около 27 миллионов советских граждан. Память о подвиге народа священна для каждого из нас.",
      "startDate": 1941,
      "endDate": 1945,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Знамя Победы", "Награды ВОВ", "Оружие Победы"]
    },
    {
      "id": "space-era",
      "hallId": "soviet-era",
      "title": "Покорение космоса",
      "description": "Полёт Юрия Гагарина, первый спутник и триумф советской космонавтики.",
      "fullDescription": "12 апреля 1961 года советский космонавт Юрий Алексеевич Гагарин совершил первый в истории человечества полёт в космос. На корабле «Восток-1» он облетел Землю за 108 минут, открыв космическую эру.\n\nЭтому триумфу предшествовал запуск первого искусственного спутника Земли 4 октября 1957 года. СССР опередил США в космической гонке, продемонстрировав научно-технические достижения социалистического строя.\n\nВслед за Гагариным в космос отправились десятки советских космонавтов. Валентина Терешкова стала первой женщиной-космонавтом, Алексей Леонов первым вышел в открытый космос. Космическая программа СССР остаётся предметом национальной гордости, а 12 апреля отмечается как День космонавтики.",
      "startDate": 1961,
      "endDate": 1961,
      "image": "/placeholder.svg?height=500&width=800",
      "artifacts": ["Скафандр Гагарина", "Макет корабля Восток", "Космические приборы"]
    },
        {
      "id": "double-headed-eagle",
      "hallId": "kremlin-tour",
      "title": "Двуглавый орёл на печати Ивана III",
      "description": "Впервые в истории России двуглавый орёл появился на государственной печати Ивана III в 1497 году, став символом объединения русских земель и мощи Московского княжества.",
      "fullDescription": "Двуглавый орёл впервые появился на государственной печати великого князя Ивана III в 1497 году, знаменуя собой рождение официальной государственной символики России. Этот символ стал визуальным воплощением идеи объединения русских земель под властью Москвы.\n\nВыбор двуглавого орла имел несколько причин. Во-первых, этот символ ассоциировался с Византийской империей, преемницей которой считала себя Москва после падения Константинополя в 1453 году. Брак Ивана III с византийской принцессой Софьей Палеолог (1472) укрепил эту связь.\n\nОрёл символизировал власть, мощь и единство разнообразных русских земель. Две головы орла смотрели на Запад и Восток, что отражало геополитическое положение Московского государства. На груди орла помещался щит с изображением всадника, поражающего змея — древнего символа защитника земли русской.",
      "date": "1497",
      "startDate": 1497,
      "endDate": 1497,
      "image": "/exhibit15.png?height=500&width=800",
      "artifacts": ["Государственная печать Ивана III", "Копии грамот с оттисками", "Геральдические изображения"]
    },
    {
      "id": "kremlin-walls",
      "hallId": "kremlin-tour",
      "title": "Кремлёвские стены и башни",
      "description": "В 1485-1495 годах итальянские и русские мастера возвели современные стены и башни Московского Кремля из красного кирпича, превратив его в одну из самых мощных крепостей Европы.",
      "fullDescription": "Строительство современных кремлёвских стен и башен началось в 1485 году по приказу Ивана III. Князь пригласил итальянских архитекторов, которые вместе с русскими зодчими создали уникальное фортификационное сооружение, объединившее традиции русского оборонного зодчества и достижения западноевропейской фортификации.\n\nСтены были построены из красного кирпича с внутренней забутовкой из булыжника и белого камня на известковом растворе. Общая длина стен составила около двух километров. Толщина стен достигала 3,5-6,5 метров, высота — от 5 до 19 метров.\n\nПервой была возведена Тайницкая башня (1485) под руководством итальянца Антона Фрязина. Под башней находился тайный родник, обеспечивавший гарнизон водой в случае осады. Всего было построено 20 башен, каждая из которых представляла собой самостоятельный узел обороны. Спасская башня стала главным, парадным входом в Кремль. К концу XV века Московский Кремль превратился в одну из самых мощных крепостей Европы.",
      "date": "1485-1495",
      "startDate": 1485,
      "endDate": 1495,
      "image": "/exhibit16.png?height=500&width=800",
      "artifacts": ["Фрагменты кирпичной кладки", "Чертежи башен", "Оборонительное вооружение"]
    },
    {
      "id": "assumption-cathedral",
      "hallId": "kremlin-tour",
      "title": "Успенский собор",
      "description": "Построенный в 1475-1479 годах итальянским архитектором Аристотелем Фиораванти, Успенский собор стал главным храмом Русского государства и местом венчания на царство.",
      "fullDescription": "Успенский собор Московского Кремля, возведённый в 1475-1479 годах, стал главным храмом Русского государства и символом единства русских земель. Иван III поручил строительство итальянскому архитектору Аристотелю Фиораванти, который до начала работ изучал образцы русского зодчества во Владимире и на севере Руси.\n\nКогда после четырёх лет работы пятиглавый собор был готов, он поразил воображение современников. Современники писали, что выглядел он «яко един камень», и это ощущение монолита внушало мысль о монолитности всего народа. Неслучайно через год после завершения строительства собора Иван III отказался платить дань Золотой Орде.\n\nУспенский собор стал усыпальницей русских митрополитов и патриархов, местом венчаний и коронаций великих князей, затем царей и императоров. Здесь хранились величайшие святыни Руси. Архитектура собора воплотила идею величия и мощи объединённого Русского государства под властью московских великих князей.",
      "date": "1475-1479",
      "startDate": 1475,
      "endDate": 1479,
      "image": "/exhibit17.png?height=500&width=800",
      "artifacts": ["Иконостас XV века", "Фрески и росписи", "Предметы церковной утвари"]
    },
    {
      "id": "faceted-chamber",
      "hallId": "kremlin-tour",
      "title": "Грановитая палата",
      "description": "Построенная в 1487-1491 годах Марко Руффо и Пьетро Антонио Солари, Грановитая палата стала парадным тронным залом русских царей с уникальным сводчатым перекрытием.",
      "fullDescription": "Грановитая палата, возведённая в 1487-1491 годах итальянскими мастерами Марко Руффо и Пьетро Антонио Солари, представляет собой уникальное архитектурное творение. Она стала парадным тронным залом, где принимали иностранных послов, проводили торжественные церемонии и пиры.\n\nДля XV века Грановитая палата была инженерным чудом: зал площадью в 500 квадратных метров, своды которого опираются лишь на один центральный столб. Такое архитектурное решение не имело аналогов в русском зодчестве того времени и демонстрировало возможности новых строительных технологий.\n\nНазвание «Грановитая» палата получила благодаря облицовке главного фасада белым камнем, обтёсанным на четыре грани (в форме бриллиантового руста). Интерьер палаты был богато украшен росписями, повествующими о библейских сюжетах и важнейших событиях русской истории. Грановитая палата входила в состав Большого Кремлёвского дворца и воплощала величие и мощь Московского государства.",
      "date": "1487-1491",
      "startDate": 1487,
      "endDate": 1491,
      "image": "/exhibit18.png?height=500&width=800",
      "artifacts": ["Элементы декора", "Изображения интерьера", "Предметы царского обихода"]
    },
    {
      "id": "ivan-great-bell-tower",
      "hallId": "kremlin-tour",
      "title": "Колокольня Ивана Великого",
      "description": "Построенная в 1505-1508 годах архитектором Боном Фрязиным, колокольня высотой 81 метр стала архитектурной доминантой Кремля и символом величия Москвы.",
      "fullDescription": "Колокольня «Иван Великий», возведённая в 1505-1508 годах итальянским архитектором Боном Фрязином, стала вертикальной доминантой всего кремлёвского ансамбля. Первоначально высота колокольни составляла около 60 метров, а в 1600 году при Борисе Годунове она была надстроена до 81 метра.\n\nАрхитектор точно рассчитал, что эта архитектурная вертикаль будет доминировать над всем ансамблем, придавая ему неповторимую окраску. До начала XVIII века колокольня оставалась самым высоким зданием в России, и по указу запрещалось строить что-либо выше неё в Москве.\n\nНа колокольне размещались 34 колокола различных размеров. Самый большой колокол весил 64 тонны. Звон кремлёвских колоколов был слышен на расстоянии до 30 километров. Колокольня служила не только религиозным целям, но и дозорной башней — с её высоты просматривались окрестности Москвы на 25-30 километров. Иван Великий стал символом величия и мощи Московского государства, «стержнем» всего архитектурного ансамбля Кремля.",
      "date": "1505-1508",
      "startDate": 1505,
      "endDate": 1508,
      "image": "/exhibit19.png?height=500&width=800",
      "artifacts": ["Колокола XV-XVI веков", "Чертежи колокольни", "Надписи и декоративные элементы"]
    }
  ],
  "developers": [
    {
      "id": "dev-1",
      "name": "Александр Петров",
      "role": "Разработчик",
      "avatar": "/placeholder.svg?height=200&width=200",
      "description": "Отвечал за frontend разработку и дизайн сайта"
    },
    {
      "id": "dev-2",
      "name": "Мария Иванова",
      "role": "Исследователь",
      "avatar": "/placeholder.svg?height=200&width=200",
      "description": "Подготовка исторических материалов и контента"
    },
    {
      "id": "dev-3",
      "name": "Дмитрий Сидоров",
      "role": "Дизайнер",
      "avatar": "/placeholder.svg?height=200&width=200",
      "description": "Визуальное оформление и пользовательский интерфейс"
    }
  ]
}
